In [1]:
import pandas as pd
df = pd.read_csv("test.csv")

## Dropping Cabin as it has too many missing values

In [8]:
df = df.drop(['Cabin'],axis=1)

In [6]:
df.shape

(418, 11)

## Filling Age's and Fare's missing values with mean

In [11]:
df['Age'].fillna((df['Age'].mean()), inplace=True)

In [14]:
df['Fare'].fillna((df['Fare'].mean()), inplace=True)

In [15]:
df.isna().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [12]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S